---
kind: type
id: T:Autodesk.Revit.DB.ColorFillSchemeEntry
source: html/065ddef3-065a-8bd5-9d34-4d2efd126e43.htm
---
# Autodesk.Revit.DB.ColorFillSchemeEntry

Represents an entry of a [!:Autodesk::Revit::DB::ColorFillScheme] .

## Syntax (C#)
```csharp
public class ColorFillSchemeEntry : IDisposable
```